# YOLO11 + BiFPN + Multi-CBAM

nc: 80

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


# ---------------- BACKBONE ----------------
backbone:

  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, CustomCBAM, []]

  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, CustomCBAM, []]   # P3

  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, CustomCBAM, []]   # P4

  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, CustomCBAM, []]

  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 1, CustomCBAM, []]

  - [-1, 2, C2PSA, [1024]]    # P5


# ---------------- HEAD ----------------
head:

  # BiFPN
  - [[6, 9, 15], 1, BiFPN, [256]]   # outputs P3,P4,P5

  # Detect
  - [[16], 1, Detect, [nc]]