nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]
# YOLO11n backbone
backbone:
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]]
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]]
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]]
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]]
  - [-1, 2, C2PSA, [1024]]     # 10
  - [-1, 1, CustomCBAM, []]    # 11 ✅ CBAM backbone (QUAN TRỌNG)

# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 12
  - [[-1, 6], 1, Concat, [1]]                    # 13
  - [-1, 2, C3k2, [512, False]]                  # 14

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 15
  - [[-1, 4], 1, Concat, [1]]                    # 16
  - [-1, 2, C3k2, [256, False]]                  # 17 (P3)

  - [-1, 1, Conv, [256, 3, 2]]                   # 18
  - [[-1, 14], 1, Concat, [1]]                   # 19
  - [-1, 2, C3k2, [512, False]]                  # 20 (P4)
  - [-1, 1, CustomCBAM, []]                      # 21 ✅ CBAM tại P4

  - [-1, 1, Conv, [512, 3, 2]]                   # 22
  - [[-1, 11], 1, Concat, [1]]                   # 23 (dùng output sau CBAM backbone)
  - [-1, 2, C3k2, [1024, True]]                  # 24 (P5)

  - [[17, 21, 24], 1, Detect, [nc]]              # Detect