# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Ultralytics YOLO11 object detection model with P3/8 - P5/32 outputs
# Model docs: https://docs.ultralytics.com/models/yolo11
# Task docs: https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolo11n.yaml' will call yolo11.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.50, 0.25, 1024] # summary: 181 layers, 2624080 parameters, 2624064 gradients, 6.6 GFLOPs
  s: [0.50, 0.50, 1024] # summary: 181 layers, 9458752 parameters, 9458736 gradients, 21.7 GFLOPs
  m: [0.50, 1.00, 512] # summary: 231 layers, 20114688 parameters, 20114672 gradients, 68.5 GFLOPs
  l: [1.00, 1.00, 512] # summary: 357 layers, 25372160 parameters, 25372144 gradients, 87.6 GFLOPs
  x: [1.00, 1.50, 512] # summary: 357 layers, 56966176 parameters, 56966160 gradients, 196.0 GFLOPs

# YOLO11n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 2, C3k2, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9
  - [-1, 2, C2PSA, [1024]] # 10

# YOLO11n head
head:
  # ======================
  # TOP-DOWN (P5 → P4)
  # ======================
  - [-1, 1, Conv, [512, 1, 1]]                 # 11 P5 → 512
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 12
  - [6, 1, Conv, [512, 1, 1]]                  # 13 P4 → 512
  - [[-1, -2], 1, BiFPN_Add, []]               # 14 fuse
  - [-1, 1, C3k2, [512, False]]                # 15 P4_td

  # ======================
  # TOP-DOWN (P4 → P3)
  # ======================
  - [-1, 1, Conv, [256, 1, 1]]                 # 16
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 17
  - [4, 1, Conv, [256, 1, 1]]                  # 18 P3 → 256
  - [[-1, -2], 1, BiFPN_Add, []]               # 19 fuse
  - [-1, 1, C3k2, [256, False]]                # 20 P3_out

  # ======================
  # BOTTOM-UP (P3 → P4)
  # ======================
  - [-1, 1, Conv, [256, 3, 2]]                 # 21 down P3
  - [15, 1, Conv, [256, 1, 1]]                 # 22 align P4_td
  - [[-1, -2], 1, BiFPN_Add, []]               # 23 fuse
  - [-1, 1, C3k2, [512, False]]                # 24 P4_out

  # ======================
  # BOTTOM-UP (P4 → P5)
  # ======================
  - [-1, 1, Conv, [512, 3, 2]]                 # 25 down P4
  - [10, 1, Conv, [512, 1, 1]]                 # 26 P5 → 512
  - [[-1, -2], 1, BiFPN_Add, []]               # 27 fuse
  - [-1, 1, C3k2, [1024, True]]                # 28 P5_out

  # ======================
  # DETECT
  # ======================
  - [[20, 24, 28], 1, Detect, [nc]]            # 29
