# Parameters
nc: 80

scales:
  n: [0.50, 0.25, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          
  - [-1, 1, Conv, [128, 3, 2]]         
  - [-1, 2, C3k2, [256, False, 0.25]]  
  - [-1, 1, Conv, [256, 3, 2]]         
  - [-1, 2, C3k2, [512, False, 0.25]]  

  - [-1, 1, CustomCBAM, []]            

  - [-1, 1, Conv, [512, 3, 2]]         
  - [-1, 2, C3k2, [512, True]]         
  - [-1, 1, Conv, [1024, 3, 2]]        
  - [-1, 2, C3k2, [1024, True]]        
  - [-1, 1, SPPF, [1024, 5]]           
  - [-1, 2, C2PSA, [1024]]             


head:

  - [4, 1, Conv, [256, 1, 1]]      # 12  P3
  - [-1, 1, MHSA, [8]]             # 13

  - [7, 1, Conv, [256, 1, 1]]      # 14  P4
  - [-1, 1, MHSA, [8]]             # 15

  - [11, 1, Conv, [256, 1, 1]]     # 16  P5
  - [-1, 1, MHSA, [8]]             # 17

  - [[13,15,17], 1, Detect, [nc]]