# Ultralytics YOLO11 + BiFPN + Multi-CBAM

nc: 80

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]


# ---------------- BACKBONE ----------------
backbone:
  # [from, repeats, module, args]

  - [-1, 1, Conv, [64, 3, 2]]          # 0 P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1 P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, CustomCBAM, []]            # 3  CBAM1

  - [-1, 1, Conv, [256, 3, 2]]         # 4 P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 5
  - [-1, 1, CustomCBAM, []]            # 6  CBAM2

  - [-1, 1, Conv, [512, 3, 2]]         # 7 P4/16
  - [-1, 2, C3k2, [512, True]]         # 8
  - [-1, 1, CustomCBAM, []]            # 9  CBAM3

  - [-1, 1, Conv, [1024, 3, 2]]        # 10 P5/32
  - [-1, 2, C3k2, [1024, True]]        # 11
  - [-1, 1, CustomCBAM, []]            # 12 CBAM4

  - [-1, 1, SPPF, [1024, 5]]           # 13
  - [-1, 1, CustomCBAM, []]            # 14 CBAM5

  - [-1, 2, C2PSA, [1024]]             # 15


# ---------------- HEAD (BiFPN style) ----------------
head:

  # P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 16
  - [[-1, 9], 1, Concat, [1]]                   # 17
  - [-1, 2, C3k2, [512, False]]                 # 18
  - [-1, 1, CustomCBAM, []]                     # 19

  # P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]  # 20
  - [[-1, 6], 1, Concat, [1]]                   # 21
  - [-1, 2, C3k2, [256, False]]                 # 22
  - [-1, 1, CustomCBAM, []]                     # 23

  # P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]                  # 24
  - [[-1, 18], 1, Concat, [1]]                  # 25
  - [-1, 2, C3k2, [512, False]]                 # 26
  - [-1, 1, CustomCBAM, []]                     # 27

  # P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]                  # 28
  - [[-1, 15], 1, Concat, [1]]                  # 29
  - [-1, 2, C3k2, [1024, True]]                 # 30
  - [-1, 1, CustomCBAM, []]                     # 31


  # Detect
  - [[22, 26, 30], 1, Detect, [nc]]             # 32