# Ultralytics 🚀 AGPL-3.0 License - https://ultralytics.com/license

# Parameters
nc: 80
scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

# Backbone (Bắt buộc phải sát lề trái)
backbone:
  - [-1, 1, Conv, [64, 3, 2]]         # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]]        # 1-P2/4
  - [-1, 2, C3k2, [256, False, 0.25]] # 2
  - [-1, 1, Conv, [256, 3, 2]]        # 3-P3/8
  - [-1, 2, C3k2, [512, False, 0.25]] # 4
  - [-1, 1, Conv, [512, 3, 2]]        # 5-P4/16
  - [-1, 2, C3k2, [512, True]]        # 6
  - [-1, 1, Conv, [1024, 3, 2]]       # 7-P5/32
  - [-1, 2, C3k2, [1024, True]]       # 8
  - [-1, 1, SPPF, [1024, 5]]          # 9
  - [-1, 2, C2PSA, [1024]]            # 10

# Head (Bắt buộc phải sát lề trái)
# Head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 11
  - [[-1, 6], 1, BiFPN_Concat, [1]]            # 12
  - [-1, 2, C3k2, [512, False]]                # 13
  - [-1, 1, CustomCBAM, []]                    # 14 (Đầu ra P4_td đã qua CBAM)

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 15
  - [[-1, 4], 1, BiFPN_Concat, [1]]            # 16
  - [-1, 2, C3k2, [256, False]]                # 17
  - [-1, 1, CustomCBAM, []]                    # 18 (Đầu ra P3_out -> Gửi tới Detect)

  - [-1, 1, Conv, [256, 3, 2]]                 # 19: Downsample P3
  - [[-1, 14, 6], 1, BiFPN_Concat, [1]]        # 20: Nối P3 downsampled + P4_td (layer 14) + P4 backbone (layer 6)
  - [-1, 2, C3k2, [512, False]]                # 21
  - [-1, 1, CustomCBAM, []]                    # 22 (Đầu ra P4_out -> Gửi tới Detect)

  - [-1, 1, Conv, [512, 3, 2]]                 # 23: Downsample P4
  - [[-1, 10], 1, BiFPN_Concat, [1]]           # 24: Nối P4 downsampled + P5 backbone (layer 10)
  - [-1, 2, C3k2, [1024, True]]                # 25 (Đầu ra P5_out -> Gửi tới Detect)

  - [[18, 22, 25], 1, Detect, [nc]]            # 26: Lấy 3 output 18, 22, 25 vào đầu dò